БухЭксп/DataProcessors/CW_ПФ_Док_ОтчетЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ПФ_Док_ОтчетЭкспедитора</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ОтчетЭкспедитора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДокументыОтчетаЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДокументыОтчетаЭкспедитора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОтчетЭкспедитора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ОтчетЭкспедитора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_ОтчетЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ОтчетЭкспедитора</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер_основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеревставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПеревыставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПроведенияДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначениеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаПредоплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаПредоплату_Значение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируютсясчетаФактуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияОтбораПриКопировании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗатрат</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьСчетФактура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыВознаграждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ПФ_Док_ОтчетЭкспедитора/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
// информация об обработке
#Область Служебные_данные
Функция Информация() Экспорт 
	
	СтруктураОписания 		= CW_ПодключаемыеКомандыСервер.СведенияОПодключаемомОбъекте("3.2.2.1");
	СтруктураОписания.Тип 	= CW_ПодключаемыеКомандыСервер.ТипОбработка();
	СтруктураОписания.Вид 	= CW_ПодключаемыеКомандыСервер.ВидОбработкиВидПечатнаяФорма();
	
	СтруктураОписания.Наименование 				= "Отчет агента";
	СтруктураОписания.Описание 					= "Отчет агента";
	СтруктураОписания.Версия					= "3.2.8.1";
	СтруктураОписания.МинимальнаяВерсияМодуля   = "8.3.15.8";
	
	CW_ПодключаемыеКомандыСервер.УстановитьМетодыВнешнегоОбъекта(СтруктураОписания, "Регистрация");
	
	//Макросы  шаблона представления
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[НомерДокумента]", 			"Номер документа", 				"ПолучитьНомерДокумента(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yyyy]", "Дата документа (dd.MM.yyyy)", 	"ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры)");	
	CW_ПодключаемыеКомандыСервер.УстановитьМакросыШаблонаПредставленияОбъекта(СтруктураОписания, "[ДатаДокумента, dd.MM.yy]", 	"Дата документа (dd.MM.yy)",	"ПолучитьДатуДокументаГГ(ПараметрыПроцедуры)");	
	//Макросы  шаблона представления
	
	Возврат СтруктураОписания;
	
КонецФункции

Процедура Регистрация(Ссылка) Экспорт 

	ИменаМетаданных = Новый Массив;
	ИменаМетаданных.Добавить("Документ.CW_ОтчетЭкспедитора");
	
	ПарамерыРегистрации = CW_ПодключаемыеКомандыСервер.НоваяСтруктураПараметрыРегистрации();
	ПарамерыРегистрации.ПодключаемыйОбъект 	= Ссылка; 
	ПарамерыРегистрации.Представление 		= "Отчет экспедитора"; 
	ПарамерыРегистрации.ИменаМетаданных		= ИменаМетаданных; 		

	CW_ПодключаемыеКомандыСервер.ОбновитьРегистрациюПечатнойФормы(ПарамерыРегистрации);
	
КонецПроцедуры

Функция Использование() Экспорт 
	
	Используется = истина;
	
	Если СсылкаНаОбъект.ПометкаУдаления Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ помечен на удаление";
		Сообщение.Сообщить();
		
		Используется = Ложь;
		
	КонецЕсли;
	
	Возврат Используется;
	
КонецФункции

//Функции макросов шаблона представления
Функция ПолучитьНомерДокумента(ПараметрыПроцедуры) Экспорт
	
	Возврат СокрЛП(ПараметрыПроцедуры.НомерДокумента);
	
КонецФункции

Функция ПолучитьДатуДокументаГГГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
КонецФункции

Функция ПолучитьДатуДокументаГГ(ПараметрыПроцедуры) Экспорт
	
	Возврат Формат(ПараметрыПроцедуры.ДатаДокумента, "ДФ=dd.MM.yy");
	
КонецФункции
//Функции макросов шаблона представления

#КонецОбласти

Функция ПечатнаяФорма(НастройкиПечати=Неопределено) Экспорт
	
	Если НастройкиПечати = Неопределено Тогда
		НастройкиПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
	КонецЕсли;  
	
	РезультатПечати = CW_ПодключаемыеКомандыСервер.НоваяСтруктураРезультатаПечати();
	
	КоличествоЭксземпляров = CW_Настройки.ПолучитьНастройкуПользователя(, "КоличествоЭкземпляровИсхАкта", Истина);
	Если КоличествоЭксземпляров <> Неопределено Тогда 
		РезультатПечати.Параметры.Количество = КоличествоЭксземпляров;
		РезультатПечати.Параметры.Печать 	 = (КоличествоЭксземпляров <> 0);  
	Иначе
		РезультатПечати.Параметры.Количество = 2;
		РезультатПечати.Параметры.Печать 	 = Истина;  
	КонецЕсли;	
	
	ВалютаРегламентированногоУчета = CW_Настройки.ВалютаРегламентированногоУчета();
	
	//Инициализация параметров договора
	ПараметрыДоговора 		= ПодготовитьПараметрыДоговора();		
	ПодписантыПоДоговору 	= CW_Печать.ВернутьПодписантов(СсылкаНаОбъект, ПараметрыДоговора);
	
	НаименованияОрганизации = Справочники.Организации.НаименованияНаДату(СсылкаНаОбъект.Организация	, СсылкаНаОбъект.Дата);
	КППОрганизации 			= Справочники.Организации.КППНаДату(СсылкаНаОбъект.Организация			, СсылкаНаОбъект.Дата);
	
	НаименованияКонтрагента = Справочники.Контрагенты.НаименованияНаДату(СсылкаНаОбъект.Контрагент	, СсылкаНаОбъект.Дата);
	КППКонтрагента 			= Справочники.Контрагенты.КППНаДату(СсылкаНаОбъект.Контрагент			, СсылкаНаОбъект.Дата);
	
	#Область Параметры_печати
	НомерДокумента 				= CW_Документы.ПолучитьНомерНаПечать(СсылкаНаОбъект);
	ПредставлениеДокумента     	= ?(ПараметрыДоговора.ХарактерДоговора=0, "Отчет экспедитора №" , "Отчет агента №") + НомерДокумента + " от " + Формат(СсылкаНаОбъект.Дата, "ДФ=dd.MM.yyyy");
	
	//Установка представления печатной формы
	ПараметрыПодключаемогоОбъекта = Новый Структура;
	ПараметрыПодключаемогоОбъекта.Вставить("ПодключаемыйОбъект",	НастройкиПечати.ПодключаемыйОбъект);
	ПараметрыПодключаемогоОбъекта.Вставить("ШаблонПредставления",	НастройкиПечати.ШаблонПредставления);
	ПараметрыПодключаемогоОбъекта.Вставить("Представление",			СокрЛП(ПредставлениеДокумента));
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("НомерДокумента",	НомерДокумента);
	ПараметрыПроцедуры.Вставить("ДатаДокумента",	СсылкаНаОбъект.Дата);
	
	РезультатПечати.Представление = CW_ПодключаемыеКомандыСервер.ПолучитьПредставлениеПоШаблону(ЭтотОбъект, ПараметрыПодключаемогоОбъекта, ПараметрыПроцедуры);
	//Установка представления печатной формы
	
	#КонецОбласти
	                                                                             
	НадписьИсполнитель = ?(ПараметрыДоговора.ХарактерДоговора=0, "Экспедитор:" 	, "Агент:");
	НадписьЗаказчик    = ?(ПараметрыДоговора.ХарактерДоговора=0, "Заказчик:"	, "Принципал:");
	
	//инициализация макета
	Макет 	= ПолучитьМакет("МакетОтчетЭкпедитора");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  	= ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	
	#Область Область_Исполнитель_Зказчик
	
	ОбластьШапка_верх = Макет.ПолучитьОбласть("Шапка_верх");
	ОбластьШапка_верх.Параметры.НадписьИсполнитель 	= НадписьИсполнитель;
	ОбластьШапка_верх.Параметры.НадписьЗаказчик    	= НадписьЗаказчик;
	
	
	ТекстИсполнителя = НаименованияОрганизации.НаименованиеДляПечатныхФорм 								+ символы.пс +
	"ИНН: "		+ СсылкаНаОбъект.Организация.ИНН 									+ Символы.ПС +
	"Адрес: " 	+ ПараметрыДоговора.АдресОрганизации 								+ Символы.ПС +
	"Р/С: " 	+ ПараметрыДоговора.РасчетныйСчетОрганизации.НомерСчета 			+ Символы.ПС +
	ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.Наименование 	+ Символы.ПС +
	"К/С: " 	+ ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.КоррСчет 			+ Символы.ПС +
	"БИК: " 	+ ПараметрыДоговора.РасчетныйСчетОрганизации.Банк.Код;
	
	ОбластьШапка_верх.Параметры.Исполнитель 	= ТекстИсполнителя;
	
	ТекстЗаказчика = 	НаименованияКонтрагента.ПолноеНаименование 						+ символы.пс +
	"ИНН: "		+ СсылкаНаОбъект.Контрагент.ИНН 					+ Символы.ПС +
	"Адрес: " 	+ ПараметрыДоговора.Адрес  							+ Символы.ПС +
	"Р/С: " 	+ ПараметрыДоговора.РасчетныйСчет.НомерСчета		+ Символы.ПС +
	ПараметрыДоговора.РасчетныйСчет.Банк.Наименование + Символы.ПС +
	"К/С: " 	+ ПараметрыДоговора.РасчетныйСчет.Банк.КоррСчет 	+ Символы.ПС +
	"БИК: " 	+ ПараметрыДоговора.РасчетныйСчет.Банк.Код;
	
	ОбластьШапка_верх.Параметры.Заказчик 	= ТекстЗаказчика;
	
	ТабличныйДокумент.Вывести(ОбластьШапка_верх);
	
	#КонецОбласти
	
	
	#Область Область_Текст_шапки
	
	ОбластьШапка_текст = Макет.ПолучитьОбласть("Шапка_текст");
	
	НомерДокумента = CW_Документы.ПолучитьНомерНаПечать(СсылкаНаОбъект);
	
	ПредставлениеПриложения = ПолучитьПредставлениеПриложения();
	
	ОбластьШапка_текст.Параметры.ТекстЗаголовка  			= ПредставлениеДокумента;
	ОбластьШапка_текст.Параметры.НомерДоговора   			= ПараметрыДоговора.НомерДоговора;
	ОбластьШапка_текст.Параметры.ДатаДоговора 	 			= Формат(ПараметрыДоговора.ДатаДоговора,"ДФ=dd.MM.yyyy");
	ОбластьШапка_текст.Параметры.ПредставлениеПриложения 	= ПредставлениеПриложения;
	ТабличныйДокумент.Вывести(ОбластьШапка_текст);
	
	#КонецОбласти
	
	
	#Область Дополнение_шапки
	
	Если ПараметрыДоговора.ВыводитьДополнениеВШапкеОтчетаЭкспедитора Тогда
		Область_ДополнениеШапки = Макет.ПолучитьОбласть("ДополнениеШапки");
		
		Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
			Область_ДополнениеШапки.Параметры.ДополнениеШапки = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеОтчетаЭкспедитораАнгл, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
		ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
			Область_ДополнениеШапки.Параметры.ДополнениеШапки = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеОтчетаЭкспедитора, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги) + " / " + CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеОтчетаЭкспедитораАнгл, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
		Иначе
			Область_ДополнениеШапки.Параметры.ДополнениеШапки = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВШапкеОтчетаЭкспедитора, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область_ДополнениеШапки);
	КонецЕсли;
	
	#КонецОбласти
	
	#Область Область_Шапка_таблицы
	
	ОбластьТаблица_шапка = Макет.ПолучитьОбласть("Таблица_шапка");
	ОбластьТаблица_шапка.Параметры.Валюта = ?(ПараметрыДоговора.ВзаиморасчетыВУЕ,ВалютаРегламентированногоУчета, ПараметрыДоговора.ВалютаДокумента);
	
	ТабличныйДокумент.Вывести(ОбластьТаблица_шапка);
	
	#КонецОбласти
	
	#Область Получение_данных_для_печати
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент КАК СвязанныйДокумент
	               |ПОМЕСТИТЬ ВТ_СвязанныеДокументы
	               |ИЗ
	               |	РегистрСведений.CW_ДокументыОтчетаЭкспедитора КАК CW_ДокументыОтчетаЭкспедитора
	               |ГДЕ
	               |	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора = &ОтчетЭкспедитора
	               |	И CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.ФормируетсяАкт = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент";
	
	
	Запрос.УстановитьПараметр("ОтчетЭкспедитора", СсылкаНаОбъект);
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов КАК ДокументРасходов,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка КАК ДокументДоходов,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Номенклатура КАК Номенклатура,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Количество КАК Количество,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Цена КАК Цена,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Сумма КАК Сумма,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.НДС КАК НДС,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Всего КАК Всего,
	               |	ВЫБОР
	               |		КОГДА CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов.ПредъявленСФ
	               |			ТОГДА CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов.ДатаСФ
	               |		КОГДА CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов.ПредъявленАкт
	               |			ТОГДА CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов.ДатаАкта
	               |		ИНАЧЕ CW_ДоходыПоГрузоперевозкеУслуги.ДокументРасходов.Дата
	               |	КОНЕЦ КАК ДатаПорядка,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Представление КАК Представление,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения КАК ПорядокОтражения,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Затраты КАК Затраты,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.СтатьяЗатрат КАК СтатьяЗатрат,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ОЗ_Всего КАК ОЗ_Всего,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ОЗ_НДС КАК ОЗ_НДС,
	               |	CW_ДоходыПоГрузоперевозкеУслуги.ОЗ_Сумма КАК ОЗ_Сумма
	               |ПОМЕСТИТЬ ВТ_Данные
	               |ИЗ
	               |	Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
	               |ГДЕ
	               |	CW_ДоходыПоГрузоперевозкеУслуги.Ссылка.Проведен
	               |	И CW_ДоходыПоГрузоперевозкеУслуги.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_СвязанныеДокументы.СвязанныйДокумент
	               |			ИЗ
	               |				ВТ_СвязанныеДокументы КАК ВТ_СвязанныеДокументы)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Данные.ДокументРасходов КАК ДокументРасходов,
	               |	ВТ_Данные.ДатаПорядка КАК ДатаПорядка,
	               |	СУММА(ВТ_Данные.Сумма) КАК Сумма,
	               |	СУММА(ВТ_Данные.НДС) КАК НДС,
	               |	СУММА(ВТ_Данные.Всего) КАК Всего,
	               |	ВТ_Данные.ДокументДоходов КАК ДокументДоходов
	               |ИЗ
	               |	ВТ_Данные КАК ВТ_Данные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Данные.ДокументРасходов,
	               |	ВТ_Данные.ДатаПорядка,
	               |	ВТ_Данные.ДокументДоходов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаПорядка
	               |АВТОУПОРЯДОЧИВАНИЕ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ_Данные.Сумма) КАК Сумма,
	               |	СУММА(ВТ_Данные.НДС) КАК НДС,
	               |	СУММА(ВТ_Данные.Всего) КАК Всего
	               |ИЗ
	               |	ВТ_Данные КАК ВТ_Данные";
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	//Документы
	Результат_Документы = ПакетРезультатовЗапроса[1];
	
	Если Результат_Документы.Пустой() Тогда
		//Нет даннх для печати
		Возврат РезультатПечати;
	КонецЕсли;
	
	Результат_ОбщиеИтоги 	= ПакетРезультатовЗапроса[2];
	
	Выборка_ОБЩИЕ 			= Результат_ОбщиеИтоги.Выбрать();
	Выборка_ОБЩИЕ.Следующий();
	
	Выборка_ДокументРасходов 	= Результат_Документы.Выбрать();
	
	ИтогоСумма_Рег = 0;
	ИтогоНДС_Рег   = 0;
	ИтогоВсего_Рег = 0;
	
	мСтавкиНДС = Новый Массив;
	
	Пока Выборка_ДокументРасходов.Следующий() Цикл
		
		НаименованияПоставщика 	= Справочники.Контрагенты.НаименованияНаДату(Выборка_ДокументРасходов.ДокументРасходов.Контрагент	, СсылкаНаОбъект.Дата);
		КПППоставщика 			= Справочники.Контрагенты.КППНаДату(Выборка_ДокументРасходов.ДокументРасходов.Контрагент			, СсылкаНаОбъект.Дата);
		ИННПоставщика 			= Выборка_ДокументРасходов.ДокументРасходов.Контрагент.ИНН;
		
		НаДату = Выборка_ДокументРасходов.ДокументРасходов.Дата;
		СведенияОПоставщике  = CW_БухгалтерияЭкспедитораСерверПереопределяемый.СведенияОЮрФизЛице(Выборка_ДокументРасходов.ДокументРасходов.Контрагент, НаДату); 	// ВызовБП
		АдресПоставщика = "Адрес: " + ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОПоставщике,"ЮридическийАдрес"); 					// ВызовБП
		
		//АКТ поставщика
		НомерАкта 		= СокрЛП(Выборка_ДокументРасходов.ДокументРасходов.НомерАкта);
		АктПоставщика 	= "№" + НомерАкта + " от " + Формат(Выборка_ДокументРасходов.ДокументРасходов.ДатаАкта,"ДФ=dd.MM.yyyy");
		
		//Счет-фактура постащика
		Если Выборка_ДокументРасходов.ДокументРасходов.ПредъявленСФ Тогда
			НомерСФ								= СокрЛП(Выборка_ДокументРасходов.ДокументРасходов.НомерСФ);
			СчетФактураПоставщикаПредставление 	= "№" + НомерСФ + " от " + Формат(Выборка_ДокументРасходов.ДокументРасходов.ДатаСФ,"ДФ=dd.MM.yyyy"); 
		Иначе	
			СчетФактураПоставщикаПредставление = " - ";
		КонецЕсли;	
		
		//Счет-фактура клиента
		Если Выборка_ДокументРасходов.ДокументДоходов.ФормируетсяСчетФактура Тогда
			НомерСчетаФактуры				= CW_Документы.ПолучитьНомерНаПечать(Выборка_ДокументРасходов.ДокументДоходов,"НомерСчетаФактуры","ДатаСчетаФактуры");
			СчетФактураКлиентаПредставление = "№ " + НомерСчетаФактуры + " от " + Формат(Выборка_ДокументРасходов.ДокументДоходов.ДатаСчетаФактуры, "ДФ=dd.MM.yyyy");
			ЗаголовокСчетФактуры 			= "Выдан счет-фактура ";
		Иначе
			//АКТ
			НомерАктаКлиента				= CW_Документы.ПолучитьНомерНаПечать(Выборка_ДокументРасходов.ДокументДоходов,"НомерАкта","ДатаАкта");
			СчетФактураКлиентаПредставление = "№ " + НомерАктаКлиента + " от " + Формат(Выборка_ДокументРасходов.ДокументДоходов.ДатаАкта, "ДФ=dd.MM.yyyy");
			ЗаголовокСчетФактуры 			= "Выдан акт ";
		КонецЕсли;
		
		//Выводим
		ОбластьСтрока_поставщик = Макет.ПолучитьОбласть("Строка_поставщик");
		
		ИнформацияПоставщика 	= 	"Поставщик: " + НаименованияПоставщика.НаименованиеДляПечатныхФорм + " " + АдресПоставщика + " ИНН/КПП поставщика: "+ ИННПоставщика + "/" + КПППоставщика + Символы.ПС+
		"Поступление от поставщика: " + АктПоставщика + Символы.ПС+
		"Получен счет-фактура от поставщика: " + СчетФактураПоставщикаПредставление + Символы.ПС+
		ЗаголовокСчетФактуры +?(ПараметрыДоговора.ХарактерДоговора=0, "заказчику:"		, "принципалу:") + СчетФактураКлиентаПредставление;
		
		ОбластьСтрока_поставщик.Параметры.ИнформацияПоставщика = ИнформацияПоставщика;
		
		ТабличныйДокумент.Вывести(ОбластьСтрока_поставщик);
		
		//ДЕТАЛИ
	
		ТаблицаДетали = CW_Финансы.ПолучитьУслугиДокумента(Выборка_ДокументРасходов.ДокументДоходов);
		ТаблицаДетали.Колонки.Добавить("ПредставлениеГП");
		
		Для Каждого СтрокаДетали из ТаблицаДетали Цикл
			СтрокаДетали.ПредставлениеГП = СокрЛП(СтрокаДетали.Грузоперевозка.CW_Представление);
		КонецЦикла;	
		
		Отбор 			= Новый Структура("ДокументРасходов", Выборка_ДокументРасходов.ДокументРасходов);
		ТаблицаУслуг 	= ТаблицаДетали.Скопировать(Отбор);
		
		Если ЗначениеЗаполнено(ПараметрыДоговора.ВариантСверткиНоменклатурыДляОтчетаЭкспедитора)  Тогда
			CW_Печать.ПодготовитьТаблицуУслуг(ТаблицаУслуг,Выборка_ДокументРасходов.ДокументДоходов,ПараметрыДоговора,"ОтчетЭкспедитора");
		КонецЕсли;	
		
		Нпп = 1;
		
		ИтогоПоДокументуПоставщикаСумма_Рег = 0;
		ИтогоПоДокументуПоставщикаНДС_Рег   = 0;
		ИтогоПоДокументуПоставщикаВсего_Рег = 0;
		
		Для каждого СтрокаУслуг из ТаблицаУслуг Цикл			
			ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,СтрокаУслуг,,"Цена,Сумма,НДС,Всего"); 
			
			ОбластьСтрока.Параметры.ЕдиницаИзмерения = СтрокаУслуг.Номенклатура.ЕдиницаИзмерения;
			
			Если ПараметрыДоговора.ВзаиморасчетыВУЕ Тогда
				ОбластьСтрока.Параметры.Цена 	= СтрокаУслуг.Цена_Рег;
				ОбластьСтрока.Параметры.Сумма 	= СтрокаУслуг.Сумма_Рег;
				ОбластьСтрока.Параметры.НДС 	= СтрокаУслуг.НДС_Рег;
				ОбластьСтрока.Параметры.Всего 	= СтрокаУслуг.Всего_Рег;
				
				ИтогоПоДокументуПоставщикаСумма_Рег = ИтогоПоДокументуПоставщикаСумма_Рег 	+ СтрокаУслуг.Сумма_Рег;
				ИтогоПоДокументуПоставщикаНДС_Рег   = ИтогоПоДокументуПоставщикаНДС_Рег 	+ СтрокаУслуг.НДС_Рег;
				ИтогоПоДокументуПоставщикаВсего_Рег = ИтогоПоДокументуПоставщикаВсего_Рег	+ СтрокаУслуг.Всего_Рег;
				
				ИтогоСумма_Рег = ИтогоСумма_Рег	+ СтрокаУслуг.Сумма_Рег;
				ИтогоНДС_Рег   = ИтогоНДС_Рег 	+ СтрокаУслуг.НДС_Рег;
				ИтогоВсего_Рег = ИтогоВсего_Рег	+ СтрокаУслуг.Всего_Рег;
				
			Иначе
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,СтрокаУслуг,"Цена,Сумма,НДС,Всего"); 
			КонецЕсли;
			
			ОбластьСтрока.Параметры.Нпп =  Нпп;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			Если мСтавкиНДС.Найти(СтрокаУслуг.СтавкаНДС) = Неопределено Тогда
				мСтавкиНДС.Добавить(СтрокаУслуг.СтавкаНДС);
			КонецЕсли;
			
			Нпп = Нпп + 1;
			
		КонецЦикла;		

		//Итого по документу
		ОбластьИтогоПоДокументуПоставщика = Макет.ПолучитьОбласть("ИтогоПоДокументуПоставщика");
		
		
		Если ПараметрыДоговора.ВзаиморасчетыВУЕ Тогда
			ОбластьИтогоПоДокументуПоставщика.Параметры.Сумма 	= ИтогоПоДокументуПоставщикаСумма_Рег;
			ОбластьИтогоПоДокументуПоставщика.Параметры.НДС 	= ИтогоПоДокументуПоставщикаНДС_Рег;
			ОбластьИтогоПоДокументуПоставщика.Параметры.Всего 	= ИтогоПоДокументуПоставщикаВсего_Рег;
		Иначе
			ЗаполнитьЗначенияСвойств(ОбластьИтогоПоДокументуПоставщика.Параметры,Выборка_ДокументРасходов); 
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьИтогоПоДокументуПоставщика);
		
	КонецЦикла;
	
	ОбластьСтрока_итого = Макет.ПолучитьОбласть("Строка_итого");
	
	Если ПараметрыДоговора.ВзаиморасчетыВУЕ Тогда
		ОбластьСтрока_итого.Параметры.Сумма 	= ИтогоСумма_Рег;
		ОбластьСтрока_итого.Параметры.НДС 		= ИтогоНДС_Рег;
		ОбластьСтрока_итого.Параметры.Всего 	= ИтогоВсего_Рег;
	Иначе
		ЗаполнитьЗначенияСвойств(ОбластьСтрока_итого.Параметры,Выборка_ОБЩИЕ); 
	КонецЕсли;

	ТабличныйДокумент.Вывести(ОбластьСтрока_итого);
	
	//Подвал 
	ОбластьПодвал_текст = Макет.ПолучитьОбласть("Подвал_текст");
	
	ЕдинственнаяСтавкаНДС = Неопределено;
	Если  мСтавкиНДС.Количество() = 1 Тогда
		ЕдинственнаяСтавкаНДС = мСтавкиНДС[0];
	КонецЕсли;
	
	Если ЕдинственнаяСтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		ТекстНДС = ", без НДС";
	Иначе
		ТекстНДС = ", в т. ч. НДС " + ?(ПараметрыДоговора.ВзаиморасчетыВУЕ,Формат(ИтогоНДС_Рег, "ЧДЦ=2; ЧН=0,00"),Формат(Выборка_ОБЩИЕ.НДС, "ЧДЦ=2; ЧН=0,00")) + " " + ?(ПараметрыДоговора.ВзаиморасчетыВУЕ,ВалютаРегламентированногоУчета, ПараметрыДоговора.ВалютаДокумента);
	КонецЕсли;
	
	ПараметрыПрописи 	= ?(ПараметрыДоговора.ВзаиморасчетыВУЕ,ВалютаРегламентированногоУчета.ПараметрыПрописи, ПараметрыДоговора.ВалютаДокумента.ПараметрыПрописи);
	ПрописьЧисла 		=  ЧислоПрописью(?(ПараметрыДоговора.ВзаиморасчетыВУЕ,ИтогоВсего_Рег,Выборка_ОБЩИЕ.Всего), ,ПараметрыПрописи);
	
	ОбластьПодвал_текст.Параметры.СуммаЧислом 	=  ?(ПараметрыДоговора.ВзаиморасчетыВУЕ,Формат(ИтогоВсего_Рег, "ЧДЦ=2"),Формат(Выборка_ОБЩИЕ.Всего, "ЧДЦ=2"));
	ОбластьПодвал_текст.Параметры.СуммаПрописью	= ПрописьЧисла;
	ОбластьПодвал_текст.Параметры.ТекстНДС 		= ТекстНДС;
	ОбластьПодвал_текст.Параметры.Валюта 		= ?(ПараметрыДоговора.ВзаиморасчетыВУЕ,ВалютаРегламентированногоУчета, ПараметрыДоговора.ВалютаДокумента);
	
	ТабличныйДокумент.Вывести(ОбластьПодвал_текст);
	
	
	#Область Дополнение_шапки
	
	Если ПараметрыДоговора.ВыводитьДополнениеВПодвалеОтчетаЭкспедитора Тогда
		Область_ДополнениеПодвала = Макет.ПолучитьОбласть("ДополнениеПодвала");
		
		Если ПараметрыДоговора.ЯзыкПечатиДокументов = 1 Тогда 
			Область_ДополнениеПодвала.Параметры.ДополнениеПодвала = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВПодвалеОтчетаЭкспедитораАнгл, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
		ИначеЕсли ПараметрыДоговора.ЯзыкПечатиДокументов = 2 Тогда 
			Область_ДополнениеПодвала.Параметры.ДополнениеПодвала = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВПодвалеОтчетаЭкспедитора, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги) + " / " + CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВПодвалеОтчетаЭкспедитораАнгл, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
		Иначе
			Область_ДополнениеПодвала.Параметры.ДополнениеПодвала = CW_Шаблоны.ОбработатьШаблонНоменклатуры(ПараметрыДоговора.ДополнениеВПодвалеОтчетаЭкспедитора, СсылкаНаОбъект, Неопределено, СсылкаНаОбъект.Услуги);
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(Область_ДополнениеПодвала);
	КонецЕсли;
	
	#КонецОбласти
	
	
	//Подписи
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект.Руководитель) Тогда
		ФИОИсполнителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(СсылкаНаОбъект.Руководитель,СсылкаНаОбъект.Дата) + ?(ЗначениеЗаполнено(СсылкаНаОбъект.Руководитель_основание), " (" + СсылкаНаОбъект.Руководитель_основание + ")", "");
	Иначе
		ФИОИсполнителя = CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПодписантыПоДоговору.Руководитель,СсылкаНаОбъект.Дата) + ?(ЗначениеЗаполнено(ПодписантыПоДоговору.РуководительОснованиеРус), " (" + ПодписантыПоДоговору.РуководительОснованиеРус + ")", "");
	КонецЕсли;
	
	ФИОЗаказчика 	= CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(ПараметрыДоговора.Руководитель,СсылкаНаОбъект.Дата) + ?(ЗначениеЗаполнено(ПараметрыДоговора.РуководительКонтрагентаОснование), " (" + ПараметрыДоговора.РуководительКонтрагентаОснование + ")", ""); 
	
	
	ОбластьПодпись_должность 								= Макет.ПолучитьОбласть("Подпись_должность");
	
	ОбластьПодпись_должность.Параметры.НадписьИсполнитель 	= НадписьИсполнитель;
	ОбластьПодпись_должность.Параметры.НадписьЗаказчик 		= НадписьЗаказчик;
	
	ОбластьПодпись_должность.Параметры.ДолжностьИсполнителя = ПодписантыПоДоговору.РуководительДолжностьРус;
	ОбластьПодпись_должность.Параметры.ДолжностьЗаказчика 	= ПараметрыДоговора.ДолжностьРуководителя;
	
	ТабличныйДокумент.Вывести(ОбластьПодпись_должность);
	
	// подписи, печать
	ОбластьПодпись_печать 	= Макет.ПолучитьОбласть("Подпись");

	ВыводитьПодписиИПечать = НастройкиПечати.ПодписьИПечать 
	ИЛИ (ПараметрыДоговора.ПодставлятьПодписиИПечать И НастройкиПечати.ДляРассылки);
	
	Если ВыводитьПодписиИПечать Тогда
		ПечатьОрганизации  	= CW_Печать.ПолучитьПечатьОрганизации(СсылкаНаОбъект.Организация, НастройкиПечати.ПодключаемыйОбъект, СсылкаНаОбъект.Дата, Ложь);
		ПодписьРуководителя = CW_Печать.ПолучитьПодписьСотрудника(ПодписантыПоДоговору.Руководитель, Ложь);
	КонецЕсли;
	
	ОбластьПодпись_печать.Рисунки.ПечатьОрганизации.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	ОбластьПодпись_печать.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Ложь;
	Если ВыводитьПодписиИПечать и ПечатьОрганизации <> Неопределено Тогда
		ОбластьПодпись_печать.Рисунки.ПечатьОрганизации.ВыводитьНаПечать 	= Истина;
		ОбластьПодпись_печать.Рисунки.ПечатьОрганизации.Картинка 			= Новый Картинка(ПечатьОрганизации);
	КонецЕсли;
	
	ОбластьПодпись_печать.Рисунки.ПодписьРуководителя.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
	ОбластьПодпись_печать.Рисунки.ПодписьРуководителя.ВыводитьНаПечать 	= Ложь;
	Если ВыводитьПодписиИПечать и ПодписьРуководителя <> Неопределено Тогда
		ОбластьПодпись_печать.Рисунки.ПодписьРуководителя.ВыводитьНаПечать 	= Истина;
		ОбластьПодпись_печать.Рисунки.ПодписьРуководителя.Картинка 			= Новый Картинка(ПодписьРуководителя);
	КонецЕсли;
	
	//---подписи, печать	
	
	ОбластьПодпись_печать.Параметры.ФИОИсполнителя	= ФИОИсполнителя;
	ОбластьПодпись_печать.Параметры.ФиоЗаказчика	= ФИОЗаказчика;
	
	ТабличныйДокумент.Вывести(ОбластьПодпись_печать); 
	
	
	
	//исполнитель документа
	Если Не СсылкаНаОбъект.Ответственный.Пустая() и ПараметрыДоговора.ВыводитьИсполнителяОтчетЭкспедитора Тогда
		
		ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
		ТабличныйДокумент.Вывести(ОбластьРазделитель);
		
		ТелефонИсполнителя 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(СсылкаНаОбъект.Ответственный, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.ТелефонПользователя"),,Истина);		
		ИсполнительФизическоеЛицо 	= СсылкаНаОбъект.Ответственный.ФизическоеЛицо;
		
		Если ИсполнительФизическоеЛицо.Пустая() Тогда
			Исполнитель_рус = "";
		Иначе
			Исполнитель_рус = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ИсполнительФизическоеЛицо);
		КонецЕсли;
		
		ОбластьИсполнитель_Рус = Макет.ПолучитьОбласть("Исполнитель_Рус");
		ОбластьИсполнитель_Рус.Параметры.Исполнитель 		= "Исп."+ Исполнитель_рус;
		ОбластьИсполнитель_Рус.Параметры.ТелефонИсполнителя = "Тел."+ ТелефонИсполнителя;
		
		ТабличныйДокумент.Вывести(ОбластьИсполнитель_Рус);
		
	КонецЕсли;
	//исполнитель документа

	
	#КонецОбласти
	
	
	РезультатПечати.ПечатнаяФорма = ТабличныйДокумент;
	
	Возврат РезультатПечати;
	
КонецФункции

Функция ПолучитьПредставлениеПриложения()
	
	Если Не ЗначениеЗаполнено(СсылкаНаОбъект.ПриложениеКДоговору) Тогда
		Возврат "";
	КонецЕсли;
	
	ШаблонПредставления = "%1 №%2 от %3";   
	
	ВидДокумента = "Приложение";
	Если ЗначениеЗаполнено(СсылкаНаОбъект.ПриложениеКДоговору.ВидДокумента) Тогда
		ВидДокумента = СокрЛП(СсылкаНаОбъект.ПриложениеКДоговору.ВидДокумента); 
	КонецЕсли;
	
	НомерДокумента 	= СокрЛП(СсылкаНаОбъект.ПриложениеКДоговору.НомерДокумента);
	ДатаДокумента 	= Формат(СсылкаНаОбъект.ПриложениеКДоговору.ДатаДокумента, "ДФ=dd.MM.yyyy");
	
	Возврат СтрШаблон(ШаблонПредставления, 	ВидДокумента, НомерДокумента, ДатаДокумента); 
	
КонецФункции

Функция ПодготовитьПараметрыДоговора()
	
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= СсылкаНаОбъект.Дата;
	СтруктураПараметров.Договор 			= СсылкаНаОбъект.Договор;
	СтруктураПараметров.ПриложениеКДоговору = СсылкаНаОбъект.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	СтруктураПараметровБухУчета = Новый Структура;
	СтруктураПараметровБухУчета.Вставить("Договор", 				СсылкаНаОбъект.Договор);
	СтруктураПараметровБухУчета.Вставить("ПриложениеКДоговору",		СсылкаНаОбъект.ПриложениеКДоговору);
	
	ПараметрыБухгалтерскогоУчета = CW_Финансы.ПолучитьПарметрыВеденияБухгалтерскогоУчета(СтруктураПараметровБухУчета, СсылкаНаОбъект.Дата);
	
	//Дополним сформированные параметры договора его реквизитами
	ПараметрыДоговора.Вставить("БухгалтерскийУчет"			, ПараметрыБухгалтерскогоУчета.БухгалтерскийУчет);
	ПараметрыДоговора.Вставить("ВзаиморасчетыВУЕ"			, ПараметрыБухгалтерскогоУчета.ВзаиморасчетыВУЕ);
	ПараметрыДоговора.Вставить("НомерДоговора"				, СсылкаНаОбъект.Договор.НомерДоговора);
	ПараметрыДоговора.Вставить("ДатаДоговора"				, СсылкаНаОбъект.Договор.ДатаДоговора);
	ПараметрыДоговора.Вставить("ВалютаДокумента"			, СсылкаНаОбъект.ВалютаДокумента);
	ПараметрыДоговора.Вставить("ПодставлятьПодписиИПечать"	, СсылкаНаОбъект.Договор.ПодписьИПечатьОтчетаЭкспедитора);
	
	Возврат ПараметрыДоговора;                                  
	
КонецФункции
	
#КонецЕсли
